<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"76c651187bddf058d69d6d4606863c1cf9f032e9b81e2cbfc496653a45ef8dbc","plan_job_ref":"Job Create PR TF Plan comment #4 at https://github.com/RuneORakeie/terraform-fabric-demo/actions/runs/19555562015","plan_out_hash":"9ae7339faa06b965d0a716e365fed31fce70bfdc8e3c6bf0987d0bd3f93dcf4c","plan_hash":"e3277b3e5a6d23a2546af0aa3f455742f0106973d47c0b3140c56fcfbce74bc7","plan_text_format":"diff","version":"2.2.2","closed":true} -->
Terraform plan in __./tf_restore__
With backend config: `resource_group_name=datarunefabric-weu storage_account_name=tfsadataruneweu container_name=tfstate key=terraform-msfabric-restore.tfstate`<details open><summary>With variables</summary>

```hcl
admin_user        = (sensitive value)
arm_client_secret = (sensitive value)
azeventhub_saskey = (sensitive value)
client_id         = (sensitive value)
tenant_id         = (sensitive value)
```
</details>
<details>
<summary>Plan: 11 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.fabric_capacity.capacity will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "fabric_capacity" "capacity" {
+       display_name = "fcpassdatasummit2025"
+       id           = (known after apply)
+       region       = (known after apply)
+       sku          = (known after apply)
+       state        = (known after apply)
    }

  # azurerm_fabric_capacity.kql_demo will be created
+   resource "azurerm_fabric_capacity" "kql_demo" {
+       administration_members = (sensitive value)
+       id                     = (known after apply)
+       location               = "westus3"
+       name                   = "fcpassdatasummit2025"
+       resource_group_name    = "datarunefabric-wus"

+       sku {
+           name = "F2"
+           tier = "Fabric"
        }
    }

  # fabric_eventhouse.kql_demo will be created
+   resource "fabric_eventhouse" "kql_demo" {
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "eh-passdatasummit2025"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = (known after apply)
    }

  # fabric_eventstream.kql_demo_es will be created
+   resource "fabric_eventstream" "kql_demo_es" {
+       definition                = {
+           "eventstream.json" = {
+               source                = "../item-templates/eventstream_tmpl.json"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "ConnId"    = (known after apply)
+                   "KqlDbId"   = (known after apply)
+                   "KqlDbName" = "kql-db-01-passdatasummit2025"
+                   "WsId"      = (known after apply)
                }
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-es-passdatasummit2025"
+       format                    = "Default"
+       id                        = (known after apply)
+       workspace_id              = (known after apply)
    }

  # fabric_kql_dashboard.kql_demo_dash will be created
+   resource "fabric_kql_dashboard" "kql_demo_dash" {
+       definition                = {
+           "RealTimeDashboard.json" = {
+               source                = "../item-templates/RealTimeDashboard.json"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "ImgURL"      = "![markdown](https://datarune.online/img/PASS2025-Logo-Dark-Date.png)"
+                   "KqlDbId"     = (known after apply)
+                   "QuerySvcUri" = (known after apply)
+                   "WsId"        = (known after apply)
                }
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-dash-passdatasummit2025"
+       format                    = "Default"
+       id                        = (known after apply)
+       workspace_id              = (known after apply)
    }

  # fabric_kql_database.kql_demo_db_1 will be created
+   resource "fabric_kql_database" "kql_demo_db_1" {
+       definition                = {
+           "DatabaseProperties.json" = {
+               source                = "../item-templates/DatabaseProperties_01.json"
+               source_content_sha256 = (known after apply)
+               tokens                = {
+                   "KqlEhId" = (known after apply)
                }
            },
+           "DatabaseSchema.kql" = {
+               source                = "../item-templates/DatabaseSchema_01.kql"
+               source_content_sha256 = "90021d206ce120dbd93a409d6ddb922f74732520173b624373a6adb2b0553b4f"
            },
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-db-01-passdatasummit2025"
+       format                    = "Default"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = (known after apply)
    }

  # module.demo_ws_prod.fabric_workspace.fab_ws will be created
+   resource "fabric_workspace" "fab_ws" {
+       capacity_assignment_progress = (known after apply)
+       capacity_id                  = (known after apply)
+       capacity_region              = (known after apply)
+       description                  = "Terraform for Microsoft Fabric - RTI demo workspace"
+       display_name                 = "passdatasummit2025 - WS"
+       id                           = (known after apply)
+       identity                     = {
+           application_id       = (known after apply)
+           service_principal_id = (known after apply)
+           type                 = "SystemAssigned"
        }
+       onelake_endpoints            = (known after apply)
+       type                         = (known after apply)
    }

  # module.demo_ws_prod.fabric_workspace_role_assignment.fab_ws_role_assign["0"] will be created
+   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
+       id           = (known after apply)
+       principal    = {
+           id   = "743ffe5c-d759-4cc8-9c8d-15eaccf46659"
+           type = "Group"
        }
+       role         = "Contributor"
+       workspace_id = (known after apply)
    }

  # module.demo_ws_prod.fabric_workspace_role_assignment.fab_ws_role_assign["1"] will be created
+   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
+       id           = (known after apply)
+       principal    = {
+           id   = "3e7799bc-be89-4a93-b3d6-72d224fced3f"
+           type = "User"
        }
+       role         = "Admin"
+       workspace_id = (known after apply)
    }

  # module.ws_conn_eventhub.restapi_object.connection_role_assignment["0"] will be created
+   resource "restapi_object" "connection_role_assignment" {
+       api_data        = (known after apply)
+       api_response    = (known after apply)
+       create_response = (known after apply)
+       data            = jsonencode(
            {
+               principal = {
+                   id   = "743ffe5c-d759-4cc8-9c8d-15eaccf46659"
+                   type = "Group"
                }
+               role      = "Owner"
            }
        )
+       destroy_path    = (known after apply)
+       id              = (known after apply)
+       path            = (known after apply)
+       read_path       = (known after apply)
+       update_path     = (known after apply)
    }

  # module.ws_conn_eventhub.restapi_object.connection_role_assignment["1"] will be created
+   resource "restapi_object" "connection_role_assignment" {
+       api_data        = (known after apply)
+       api_response    = (known after apply)
+       create_response = (known after apply)
+       data            = jsonencode(
            {
+               principal = {
+                   id   = "3e7799bc-be89-4a93-b3d6-72d224fced3f"
+                   type = "User"
                }
+               role      = "Owner"
            }
        )
+       destroy_path    = (known after apply)
+       id              = (known after apply)
+       path            = (known after apply)
+       read_path       = (known after apply)
+       update_path     = (known after apply)
    }

  # module.ws_conn_eventhub.restapi_object.fabric_connection will be created
+   resource "restapi_object" "fabric_connection" {
+       api_data        = (known after apply)
+       api_response    = (known after apply)
+       create_response = (known after apply)
+       data            = (sensitive value)
+       debug           = true
+       destroy_path    = "/connections/{id}"
+       id              = (known after apply)
+       path            = "/connections"
+       read_path       = "/connections/{id}"
+       update_method   = "PATCH"
+       update_path     = "/connections/{id}"
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform CD - Restore #4](https://github.com/RuneORakeie/terraform-fabric-demo/actions/runs/19556425804)